In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# starting to iloc

In [3]:
data=({'Name':['Raju','Sonu','Neha','Pragati'],
    'Roll No':[1,2,3,4]})

In [4]:
data

{'Name': ['Raju', 'Sonu', 'Neha', 'Pragati'], 'Roll No': [1, 2, 3, 4]}

In [5]:
data=pd.DataFrame(data)

In [6]:
data

      Name  Roll No
0     Raju        1
1     Sonu        2
2     Neha        3
3  Pragati        4

In [11]:
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Aritra'],
                   'Age': [25, 30, 35],
                   'Location': ['Seattle', 'New York', 'Kona']})

In [13]:
df

     Name  Age  Location
0   Alice   25   Seattle
1     Bob   30  New York
2  Aritra   35      Kona

In [25]:
data = pd.DataFrame({'Roll':[1,2,3],
        'Name':['Anuj','Aditya','Sejal'],
        'Add':['virar','Vasai','Dahisar']},
        index=([10,20,30]))

In [26]:
data

    Roll    Name      Add
10     1    Anuj    virar
20     2  Aditya    Vasai
30     3   Sejal  Dahisar

In [30]:
df.index=([10,20,30])
df

      Name  Age  Location
10   Alice   25   Seattle
20     Bob   30  New York
30  Aritra   35      Kona

In [21]:
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Aritra'],
                   'Age': [25, 30, 35],
                   'Location': ['Seattle', 'New York', 'Kona']},
                  index=([10, 20, 30]))

In [31]:
 df.index=([100,200,300])

In [32]:
df

       Name  Age  Location
100   Alice   25   Seattle
200     Bob   30  New York
300  Aritra   35      Kona

In [33]:
df.columns

Index(['Name', 'Age', 'Location'], dtype='object')

In [34]:
df.dtypes

Name        object
Age          int64
Location    object
dtype: object

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 100 to 300
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Age       3 non-null      int64
 2   Location  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [36]:
random_strings_array = np.random.choice(['a', 'b', 'c'], 10 ** 6)
df = pd.DataFrame({
    'column_1': np.random.choice(['a', 'b', 'c'], 10 ** 6),
    'column_2': np.random.choice(['a', 'b', 'c'], 10 ** 6),
    'column_3': np.random.choice(['a', 'b', 'c'], 10 ** 6)
})

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   column_1  1000000 non-null  object
 1   column_2  1000000 non-null  object
 2   column_3  1000000 non-null  object
dtypes: object(3)
memory usage: 22.9+ MB

In [39]:
df.select_dtypes(include=float)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[1000000 rows x 0 columns]

In [42]:
df.select_dtypes(exclude=['int64']).head(6)

  column_1 column_2 column_3
0        c        a        b
1        a        a        c
2        b        c        b
3        c        a        c
4        a        a        c
5        a        c        a

In [45]:
df.head(6)

  column_1 column_2 column_3
0        c        a        b
1        a        a        c
2        b        c        b
3        c        a        c
4        a        a        c
5        a        c        a

In [48]:
df.values

array([['c', 'a', 'b'],
       ['a', 'a', 'c'],
       ['b', 'c', 'b'],
       ...,
       ['b', 'c', 'a'],
       ['b', 'a', 'b'],
       ['b', 'b', 'a']], dtype=object)

In [49]:
df.axes

[RangeIndex(start=0, stop=1000000, step=1),
 Index(['column_1', 'column_2', 'column_3'], dtype='object')]

In [50]:
df.ndim

2

In [51]:
s = pd.Series({'a': 1, 'b': 2, 'c': 3})
s.ndim

1

In [52]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df.ndim

2

In [64]:
df=pd.DataFrame({'col':[1],'col2':[9]})#return 1 if series and return 2 if dataframe
df.ndim

2

In [65]:
s = pd.Series({'a': 1, 'b': 2, 'c': 3})
s.size

3

In [66]:
df.size

2

In [67]:
df1 = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df1.size

4

In [68]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df.shape

(2, 2)

In [69]:
df

   col1  col2
0     1     3
1     2     4

In [70]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4],
                   'col3': [5, 6]})

In [71]:
df

   col1  col2  col3
0     1     3     5
1     2     4     6

In [73]:
df.shape

(2, 3)

In [74]:
dtypes = ['int64', 'float64', 'complex128', 'object', 'bool']

In [75]:
data = dict([(t, np.ones(shape=5000, dtype=int).astype(t))
             for t in dtypes])

In [79]:
df = pd.DataFrame(data)
df.head()

   int64  float64  complex128 object  bool
0      1      1.0    1.0+0.0j      1  True
1      1      1.0    1.0+0.0j      1  True
2      1      1.0    1.0+0.0j      1  True
3      1      1.0    1.0+0.0j      1  True
4      1      1.0    1.0+0.0j      1  True

In [80]:
df.memory_usage()

Index           132
int64         40000
float64       40000
complex128    80000
object        40000
bool           5000
dtype: int64

In [81]:
df.memory_usage(index=False)

int64         40000
float64       40000
complex128    80000
object        40000
bool           5000
dtype: int64

In [83]:
df.memory_usage(index=False,deep=True)

int64          40000
float64        40000
complex128     80000
object        180000
bool            5000
dtype: int64

In [84]:
df['object'].astype('category').memory_usage(deep=True)

5248

In [86]:
df.head()

   int64  float64  complex128 object  bool
0      1      1.0    1.0+0.0j      1  True
1      1      1.0    1.0+0.0j      1  True
2      1      1.0    1.0+0.0j      1  True
3      1      1.0    1.0+0.0j      1  True
4      1      1.0    1.0+0.0j      1  True

In [87]:
df_empty = pd.DataFrame({'A' : []})

In [88]:
df_empty

Empty DataFrame
Columns: [A]
Index: []

In [89]:
df_empty.empty

True

In [90]:
df_empty = pd.DataFrame({'A' : [np.nan]})

In [91]:
df_empty

    A
0 NaN

In [93]:
df_empty.empty

False

In [94]:
ser_empty = pd.Series({'A' : []})
ser_empty

A    []
dtype: object

In [95]:
ser_empty=pd.Series()

In [96]:
ser_empty.empty

True

In [97]:
df=pd.DataFrame({'A':[1,2]})

In [98]:
df

   A
0  1
1  2

In [99]:
df.flags.allows_duplicate_labels

True

In [100]:
df2 = df.set_flags(allows_duplicate_labels=False)

In [101]:
df2.flags.allows_duplicate_labels

False

In [102]:
df2

   A
0  1
1  2

In [103]:
d = {'col1':[1,2],'col2':[3,4]}

In [104]:
d

{'col1': [1, 2], 'col2': [3, 4]}

In [105]:
df=pd.DataFrame(d)

In [106]:
df

   col1  col2
0     1     3
1     2     4

In [107]:
df.dtypes

col1    int64
col2    int64
dtype: object

In [108]:
df.astype('int32').dtypes

col1    int32
col2    int32
dtype: object

In [111]:
ser = pd.Series([1, 2], dtype='int64')
ser

0    1
1    2
dtype: int64

In [112]:
ser

0    1
1    2
dtype: int64

In [116]:
ser.astype('category')

0    1
1    2
dtype: category
Categories (2, int64): [1, 2]

In [117]:
from pandas.api.types import CategoricalDtype

In [118]:
cat_dtype = CategoricalDtype(
    categories=[2, 1], ordered=True)
ser.astype(cat_dtype)

0    1
1    2
dtype: category
Categories (2, int64): [2 < 1]

In [119]:
ser

0    1
1    2
dtype: int64

In [120]:
cat_dtype

CategoricalDtype(categories=[2, 1], ordered=True, categories_dtype=int64)

In [121]:
ser_date = pd.Series(pd.date_range('20200101', periods=3))

In [122]:
ser_date

0   2020-01-01
1   2020-01-02
2   2020-01-03
dtype: datetime64[ns]

In [125]:
ser_datetime = pd.Series(pd.date_range('20200102',periods=3))

In [126]:
ser_datetime

0   2020-01-02
1   2020-01-03
2   2020-01-04
dtype: datetime64[ns]

In [132]:
ser_datetime = pd.Series(pd.date_range('20240903',periods=7))

In [133]:
ser_datetime

0   2024-09-03
1   2024-09-04
2   2024-09-05
3   2024-09-06
4   2024-09-07
5   2024-09-08
6   2024-09-09
dtype: datetime64[ns]

In [134]:
df = pd.DataFrame(
    {
        "a": pd.Series([1, 2, 3], dtype=np.dtype("int32")),
        "b": pd.Series(["x", "y", "z"], dtype=np.dtype("O")),
        "c": pd.Series([True, False, np.nan], dtype=np.dtype("O")),
        "d": pd.Series(["h", "i", np.nan], dtype=np.dtype("O")),
        "e": pd.Series([10, np.nan, 20], dtype=np.dtype("float")),
        "f": pd.Series([np.nan, 100.5, 200], dtype=np.dtype("float")),
    }
)

In [135]:
df

   a  b      c    d     e      f
0  1  x   True    h  10.0    NaN
1  2  y  False    i   NaN  100.5
2  3  z    NaN  NaN  20.0  200.0

In [136]:
df

   a  b      c    d     e      f
0  1  x   True    h  10.0    NaN
1  2  y  False    i   NaN  100.5
2  3  z    NaN  NaN  20.0  200.0

In [137]:
df.dtypes

a      int32
b     object
c     object
d     object
e    float64
f    float64
dtype: object

In [138]:
dfn = df.convert_dtypes()

In [139]:
dfn

   a  b      c     d     e      f
0  1  x   True     h    10   <NA>
1  2  y  False     i  <NA>  100.5
2  3  z   <NA>  <NA>    20  200.0

In [140]:
dfn.dtypes

a             Int32
b    string[python]
c           boolean
d    string[python]
e             Int64
f           Float64
dtype: object

In [141]:
s = pd.Series(["a", "b", np.nan])

In [142]:
s

0      a
1      b
2    NaN
dtype: object

In [143]:
s.convert_dtypes()

0       a
1       b
2    <NA>
dtype: string

In [144]:
s.dtypes

dtype('O')

In [145]:
df=pd.DataFrame({"A": ["a", 1, 2, 3]})

In [146]:
df

   A
0  a
1  1
2  2
3  3

In [147]:
df.dtypes

A    object
dtype: object

In [149]:
df.infer_objects().dtypes

A    object
dtype: object

In [150]:
df = df.iloc[1:]
df

   A
1  1
2  2
3  3

In [151]:
df=df.iloc[2:]

In [152]:
df

   A
3  3

In [155]:
s = pd.Series([1, 2], index=["a", "b"])
s

a    1
b    2
dtype: int64

In [156]:
s_copy = s.copy()
s_copy

a    1
b    2
dtype: int64

In [157]:
s = pd.Series([1, 2], index=["a", "b"])

In [158]:
s

a    1
b    2
dtype: int64

In [159]:
deep=s.copy()

In [160]:
deep

a    1
b    2
dtype: int64

In [161]:
shallow=s.copy(deep=False)

In [162]:
shallow

a    1
b    2
dtype: int64

In [163]:
s is shallow

False

In [165]:
s.values is shallow.values and s.index is shallow.index

True

In [166]:
 s is deep

False

In [167]:
s.values is deep.values or s.index is deep.index

False

In [168]:
s.iloc[0]=3

In [169]:
s

a    3
b    2
dtype: int64

In [170]:
shallow.iloc[1] = 4

In [171]:
shallow

a    3
b    4
dtype: int64

In [172]:
s = pd.Series([[1, 2], [3, 4]])

In [173]:
s

0    [1, 2]
1    [3, 4]
dtype: object

In [174]:
deep = s.copy()
s[0][0] = 10
s

0    [10, 2]
1     [3, 4]
dtype: object

In [175]:
pd.Series([True]).bool()

C:\Users\Admin\AppData\Local\Temp\ipykernel_9524\29854940.py:1: FutureWarning: Series.bool is now deprecated and will be removed in future version of pandas
  pd.Series([True]).bool()

True

In [176]:
pd.Series([False]).bool()

C:\Users\Admin\AppData\Local\Temp\ipykernel_9524\3499430147.py:1: FutureWarning: Series.bool is now deprecated and will be removed in future version of pandas
  pd.Series([False]).bool()

False

In [179]:

pd.DataFrame({'col': [False]}).bool()

C:\Users\Admin\AppData\Local\Temp\ipykernel_9524\2919436484.py:1: FutureWarning: DataFrame.bool is now deprecated and will be removed in future version of pandas
  pd.DataFrame({'col': [False]}).bool()

False

In [180]:
pd.DataFrame({'col': [True]}).bool()

C:\Users\Admin\AppData\Local\Temp\ipykernel_9524\937561609.py:1: FutureWarning: DataFrame.bool is now deprecated and will be removed in future version of pandas
  pd.DataFrame({'col': [True]}).bool()

True

In [181]:
pd.Series([True]).item()

True

In [182]:
pd.Series([False]).item()

False

In [183]:
df.head(-3)

Empty DataFrame
Columns: [A]
Index: []

In [184]:
df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]],
                  index=[4, 5, 6], columns=['A', 'B', 'C'])

In [185]:
df

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [186]:
df.at[4, 'B']

np.int64(2)

In [187]:
df.at[4, 'B'] = 10
df.at[4, 'B']

np.int64(10)

In [188]:
df.loc[5].at['B']

np.int64(4)

In [189]:
df

    A   B   C
4   0  10   3
5   0   4   1
6  10  20  30

In [190]:
df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]],
                  columns=['A', 'B', 'C'])

In [191]:
df

    A   B   C
0   0   2   3
1   0   4   1
2  10  20  30

In [192]:
df.iat[1,2]

np.int64(1)

In [195]:
df.iat[2, 2]

np.int64(30)

In [196]:
df.iat[1, 2] = 10
df.iat[1, 2]

np.int64(10)

In [197]:
df.loc[0].iat[1]

np.int64(2)

In [198]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
                  index=['cobra', 'viper', 'sidewinder'],
                  columns=['max_speed', 'shield'])

In [199]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [200]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [202]:
df.loc[['viper', 'sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [203]:
df.loc['cobra', 'shield']

np.int64(2)

In [204]:
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [205]:
df.loc[[False, False, True]]

            max_speed  shield
sidewinder          7       8

In [206]:
df.loc[pd.Series([False, True, False],
                 index=['viper', 'sidewinder', 'cobra'])]

            max_speed  shield
sidewinder          7       8

In [207]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [209]:
df.loc[pd.Index(["cobra", "viper"], name="zoo")]

       max_speed  shield
zoo
cobra          1       2
viper          4       5

In [210]:
df.loc[df['shield'] > 6]

            max_speed  shield
sidewinder          7       8

In [211]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [213]:
df.loc[df['shield'] > 7, ['max_speed']]

            max_speed
sidewinder          7

In [214]:
df.loc[(df['max_speed'] > 1) & (df['shield'] < 8)]

       max_speed  shield
viper          4       5

In [215]:
df.loc[(df['max_speed'] > 4) | (df['shield'] < 5)]

            max_speed  shield
cobra               1       2
sidewinder          7       8

In [216]:
df.loc[lambda df: df['shield'] == 8]

            max_speed  shield
sidewinder          7       8

In [217]:
df.loc[['viper', 'sidewinder'], ['shield']] = 50

In [218]:
df.loc['cobra'] = 10

In [219]:
df

            max_speed  shield
cobra              10      10
viper               4      50
sidewinder          7      50

In [220]:
df.loc[:, 'max_speed'] = 30

In [221]:
df

            max_speed  shield
cobra              30      10
viper              30      50
sidewinder         30      50

In [222]:
df.loc[df['shield'] > 35] = 0

In [223]:
df

            max_speed  shield
cobra              30      10
viper               0       0
sidewinder          0       0

In [224]:
df.loc["viper", "shield"] += 5

In [225]:
df

            max_speed  shield
cobra              30      10
viper               0       5
sidewinder          0       0

In [226]:
shuffled_df = df.loc[["viper", "cobra", "sidewinder"]]

In [227]:
df.loc[:] += shuffled_df
df

            max_speed  shield
cobra              60      20
viper               0      10
sidewinder          0       0

In [228]:
shuffled_df

            max_speed  shield
viper               0       5
cobra              30      10
sidewinder          0       0

In [229]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
                  index=[7, 8, 9], columns=['max_speed', 'shield'])

In [230]:
df

   max_speed  shield
7          1       2
8          4       5
9          7       8

In [231]:
df.loc[7:9]

   max_speed  shield
7          1       2
8          4       5
9          7       8

In [232]:
tuples = [
    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ('viper', 'mark ii'), ('viper', 'mark iii')
]

In [233]:
tuples

[('cobra', 'mark i'),
 ('cobra', 'mark ii'),
 ('sidewinder', 'mark i'),
 ('sidewinder', 'mark ii'),
 ('viper', 'mark ii'),
 ('viper', 'mark iii')]

In [234]:
index = pd.MultiIndex.from_tuples(tuples)

In [235]:
index

MultiIndex([(     'cobra',   'mark i'),
            (     'cobra',  'mark ii'),
            ('sidewinder',   'mark i'),
            ('sidewinder',  'mark ii'),
            (     'viper',  'mark ii'),
            (     'viper', 'mark iii')],
           )

In [236]:
values = [[12, 2], [0, 4], [10, 20],
          [1, 4], [7, 1], [16, 36]]

In [237]:
values

[[12, 2], [0, 4], [10, 20], [1, 4], [7, 1], [16, 36]]

In [238]:
df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
df

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

In [239]:
df.loc['cobra']

         max_speed  shield
mark i          12       2
mark ii          0       4

In [240]:
df.loc[('cobra', 'mark ii')]

max_speed    0
shield       4
Name: (cobra, mark ii), dtype: int64

In [241]:
df.loc['cobra', 'mark i']

max_speed    12
shield        2
Name: (cobra, mark i), dtype: int64

In [242]:
df.loc[[('cobra', 'mark ii')]]

               max_speed  shield
cobra mark ii          0       4

In [243]:
df.loc[('cobra', 'mark i'), 'shield']

np.int64(2)

In [244]:
df.loc[('cobra', 'mark i'):'viper']

                     max_speed  shield
cobra      mark i           12       2
           mark ii           0       4
sidewinder mark i           10      20
           mark ii           1       4
viper      mark ii           7       1
           mark iii         16      36

In [245]:
df.loc[('cobra', 'mark i'):('viper', 'mark ii')]

                    max_speed  shield
cobra      mark i          12       2
           mark ii          0       4
sidewinder mark i          10      20
           mark ii          1       4
viper      mark ii          7       1

In [246]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]

In [247]:
mydict

[{'a': 1, 'b': 2, 'c': 3, 'd': 4},
 {'a': 100, 'b': 200, 'c': 300, 'd': 400},
 {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]

In [248]:
df = pd.DataFrame(mydict)

In [249]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [250]:
type(df.iloc[0])

pandas.core.series.Series

In [251]:
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [252]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [253]:
df.iloc[[0, 1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [254]:
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [255]:
df.iloc[[True, False, True]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [256]:
df.iloc[lambda x: x.index % 2 == 0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [257]:
df.iloc[0, 1]

np.int64(2)

In [258]:
df.iloc[[0, 2], [1, 3]]

      b     d
0     2     4
2  2000  4000

In [259]:
df.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

In [260]:
df.iloc[:, [True, False, True, False]]

      a     c
0     1     3
1   100   300
2  1000  3000

In [261]:
df.iloc[:, lambda df: [0, 2]]

      a     c
0     1     3
1   100   300
2  1000  3000